; domain
(define
  (domain BLOCKS)
  (:requirements :strips :typing :equality)
  (:types block)
  (:constants S T A R H C U K - block)
  (:predicates (on ?x ?y - block) (ontable ?x - block) (clear ?x - block) (handempty) (holding ?x - block) (obs_0) (obs_1))
  (:action pick-up :parameters (?x - block) :precondition (and (clear ?x) (ontable ?x) (handempty)) :effect (and (not (ontable ?x)) (not (clear ?x)) (not (handempty)) (holding ?x)))
  (:action put-down :parameters (?x - block) :precondition (holding ?x) :effect (and (not (holding ?x)) (clear ?x) (handempty) (ontable ?x)))
  (:action stack :parameters (?x ?y - block) :precondition (and (holding ?x) (clear ?y) (not (= ?x ?y))) :effect (and (not (holding ?x)) (not (clear ?y)) (clear ?x) (handempty) (on ?x ?y)))
  (:action unstack :parameters (?x ?y - block) :precondition (and (on ?x ?y) (clear ?x) (handempty) (not (= ?x ?y))) :effect (and (holding ?x) (clear ?y) (not (clear ?x)) (not (handempty)) (not (on ?x ?y))))
  (:action unstack__obs1 :parameters () :precondition (and (on s a) (clear s) (handempty) (not (= s a)) (obs_0)) :effect (and (holding s) (clear a) (not (clear s)) (not (handempty)) (not (on s a)) (obs_1)))
)

; problem
(define (problem blocks_words)
(:domain blocks)
(:objects

M O T H E R W A - block
)
(:init
(HANDEMPTY)
(CLEAR M)
(ON M O)
(ONTABLE O)
(CLEAR E)
(ONTABLE E)
(CLEAR T)
(ON T W)
(ONTABLE W)
(CLEAR H)
(ONTABLE H)
(CLEAR R)
(ON R A)
(ONTABLE A)
)
(:goal (and
(CLEAR M)
(ONTABLE E)
(ON M O)
(ON O R)
(ON R E)
))
)

; plan
1. (unstack r a)
   deleted: (clear r) (handempty) (on r a)
   added: (holding r) (clear a)
   goals met: 3 of 5
2. (stack r e)
   deleted: (holding r) (clear e)
   added: (clear r) (handempty) (on r e)
   goals met: 4 of 5
3. (unstack m o)
   deleted: (clear m) (handempty) (on m o)
   added: (holding m) (clear o)
   goals met: 2 of 5
4. (stack m a)
   deleted: (holding m) (clear a)
   added: (clear m) (handempty) (on m a)
   goals met: 3 of 5
5. (pick-up o)
   deleted: (ontable o) (clear o) (handempty)
   added: (holding o)
   goals met: 3 of 5
6. (stack o r)
   deleted: (holding o) (clear r)
   added: (clear o) (handempty) (on o r)
   goals met: 4 of 5
7. (unstack m a)
   deleted: (clear m) (handempty) (on m a)
   added: (holding m) (clear a)
   goals met: 3 of 5
8. (stack m o)
   deleted: (holding m) (clear o)
   added: (clear m) (handempty) (on m o)
   goals met: 5 of 5
